class/4nov_plate_kwSST/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform (1 0 0);
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform (1 0 0);
    }

    wall
    {
        type            freestream;
	freestreamValue	uniform (1 0 0);
    }

    center
    {
        type            symmetry;
    }

    plate
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
